[
    {
        "name": "answer the phone",
        "folderName": "answer_the_phone",
        "url": "https://duckduckgo.com/?q=how+to+answer+the+phone",
        "wantedNumberResults": 2500,
        "realNumberResults": 5,
        "results": [
            {
                "title": "3 Ways to Answer the Phone Politely - wikiHow",
                "url": "https://www.wikihow.com/Answer-the-Phone-Politely",
                "snippet": "Don't answer the phone while chewing gum or food. If you're chewing gum or food, take the time before answering to spit it out or swallow it. You want your mouth to be clear and ready for conversation when you answer the phone. Even if you're talking to a friend, they may have a hard time understanding you if you have a mouth full of food."
            },
            {
                "title": "3 Ways to Answer the Phone - wikiHow",
                "url": "https://www.wikihow.com/Answer-the-Phone",
                "snippet": "How to Answer the Phone. Answering the phone is an important life skill. Professional situations, such as a business call or a call from a potential employer, may call for a more formal greeting. If you are taking call from a friend, a..."
            },
            {
                "title": "How to Answer the Phone at Work: 10 Steps (with Pictures)",
                "url": "https://www.wikihow.com/Answer-the-Phone-at-Work",
                "snippet": "Put the phone up to your face. While you want to move quickly when answering the phone, you should be patient enough to actually get the mouthpiece to your face. Make sure you don't start talking until the phone is right up against you so that the person on the other end doesn't miss any information."
            },
            {
                "title": "4 Ways to Answer a Phone Interview Call - wikiHow",
                "url": "https://www.wikihow.com/Answer-a-Phone-Interview-Call",
                "snippet": "To answer a phone interview call, start by greeting the interviewer professionally to make a good first impression. For example, in a clear voice, say \"Hello, this is Jay Gatsby.\" When the interviewer returns your greeting, jot down their name so you won't forget it, and let them know that you've been looking forward to hearing from them."
            },
            {
                "title": "How to Speak Professionally on the Phone (with Pictures ...",
                "url": "https://www.wikihow.com/Speak-Professionally-on-the-Phone",
                "snippet": "Answer the phone in as few rings as possible. No one likes to be forced to wait. Answering quickly shows the caller, who is more than likely to be a customer, that your company is efficient. It also lets the caller know that his or her call is important."
            }
        ],
        "filter": "wikihow.com"
    },
    {
        "name": "bake parmesan turkey meatballs",
        "folderName": "bake_parmesan_turkey_meatballs",
        "url": "https://duckduckgo.com/?q=how+to+bake+parmesan+turkey+meatballs",
        "wantedNumberResults": 2500,
        "realNumberResults": 2,
        "results": [
            {
                "title": "How to Bake Italian Meatballs: 15 Steps (with Pictures ...",
                "url": "https://www.wikihow.com/Bake-Italian-Meatballs",
                "snippet": "To bake Italian meatballs, start by preheating your oven to 375 degrees Fahrenheit. Then, grease a baking sheet and spread the Italian meatballs out on it so they're about 1 inch apart. Finally, bake the meatballs in the oven for 20-30 minutes or until they're brown and lightly crisped all over."
            },
            {
                "title": "How to Cook Meatballs (with Pictures) - wikiHow",
                "url": "https://www.wikihow.com/Cook-Meatballs",
                "snippet": "Meatballs are simple to make and easy to customize according to your personal tastes. The most common cooking methods include oven-baking and pan-frying. Keep reading to learn more about the different ways to prepare and cook meatballs. Makes 4 to 6 servings. 1 lb (450 g) ground meat (ground beef or ground beef combination)"
            }
        ],
        "filter": "wikihow.com"
    },
    {
        "name": "choosing outfit",
        "folderName": "choosing_outfit",
        "url": "https://duckduckgo.com/?q=how+to+choosing+outfit",
        "wantedNumberResults": 2500,
        "realNumberResults": 5,
        "results": [
            {
                "title": "How to Find the Perfect Outfit: 13 Steps (with Pictures ...",
                "url": "https://www.wikihow.com/Find-the-Perfect-Outfit",
                "snippet": "Choose one piece of clothing that you know you want to wear and build your outfit around it. For example, you may choose a bright print tie or a striking blazer. To keep things simple, just choose one article of clothing to highlight. Don't worry if you'd also like to highlight an accessory. The goal of focusing on a clothing item is to help you fashion an outfit and avoid competing clothing ..."
            },
            {
                "title": "How to Choose Good Clothes: 14 Steps (with Pictures) - wikiHow",
                "url": "https://www.wikihow.com/Choose-Good-Clothes",
                "snippet": "Choose clothes that match your skin's undertones. People with warm undertones tend to look better with warm colors, while cool colors pair best with cool-toned skin. Make outfits that incorporate complementary colors. These are colors that are opposite each other on the color wheel: purple with yellow, blue with orange, and red with green."
            },
            {
                "title": "How to Pick Out an Outfit (with Pictures) - wikiHow",
                "url": "https://www.wikihow.com/Pick-Out-an-Outfit",
                "snippet": "Choose a top, suit or dress as a first layer. Rather than trying to build an outfit around a pair of shoes or a particular jacket, start by choosing your base items. In general, you only have 3 options for your first layer - a top (you'll want to pick this out before your bottom piece), a two piece suit or a dress. Once you pick out your ..."
            },
            {
                "title": "How to Choose Your Best Clothing Colors: 12 Steps (with ...",
                "url": "https://www.wikihow.com/Choose-Your-Best-Clothing-Colors",
                "snippet": "Coordinating the right colors together makes the difference between a stunning outfit and an ugly one. Steps. Part 1 of 3: Finding Your Color Profile. 1. Determine your skin's undertone. You will want to mostly stick to colors that match your undertone. While there are many different skin tones, there are only two undertones: warm and cool. Warm skin has a yellow or orange tint, while cool ..."
            },
            {
                "title": "3 Ways to Decide What to Wear - wikiHow",
                "url": "https://www.wikihow.com/Decide-What-to-Wear",
                "snippet": "Picking an outfit to wear is stressful; you have to choose something every day and sometimes fashion fatigue is inevitable. But practice makes perfect, and the more time you spend planning your outfits, the easier it will be to plan them quickly. Give yourself some time and you may start to see your closet in an entirely new light."
            }
        ],
        "filter": "wikihow.com"
    },
    {
        "name": "clean",
        "folderName": "clean",
        "url": "https://duckduckgo.com/?q=how+to+clean",
        "wantedNumberResults": 2500,
        "realNumberResults": 2,
        "results": [
            {
                "title": "How to Be Clean: 14 Steps (with Pictures) - wikiHow",
                "url": "https://www.wikihow.com/Be-Clean",
                "snippet": "Clean a little bit every day. You don't have to dedicate a whole day to cleaning your home. Instead, clean for thirty minutes or so every day. This will spread the work out over the week, breaking harder jobs into manageable chunks. If possible, create a routine. For example: Spend ten minutes cleaning after breakfast every day."
            },
            {
                "title": "4 Ways to Clean a Keurig - wikiHow",
                "url": "https://www.wikihow.com/Clean-a-Keurig",
                "snippet": "To clean your Keurig, start by removing the drip tray and K-cup holder. Then, wash both of them using warm, soapy water. Next, take the filter out of the water reservoir, and clean the reservoir and lid with soapy water using a non-abrasive cloth. Make sure to rinse these items thoroughly so no soap remains. Finally, use a paper clip or safety pin to clean out any debris that's stuck in the ..."
            }
        ],
        "filter": "wikihow.com"
    },
    {
        "name": "cook pasta",
        "folderName": "cook_pasta",
        "url": "https://duckduckgo.com/?q=how+to+cook+pasta",
        "wantedNumberResults": 2500,
        "realNumberResults": 2,
        "results": [
            {
                "title": "How to Cook Pasta: 15 Steps (with Pictures) - wikiHow",
                "url": "https://www.wikihow.com/Cook-Pasta",
                "snippet": "To cook pasta, first add 4 quarts (4 liters) of water to a pot for every 1 pound (0.5 kilograms) of pasta you're making. Then, add 1 tablespoon (17 grams) of salt, which will give the pasta more flavor, and bring the water to a boil. Add the pasta to the water, and stir it for 30 seconds so it doesn't stick together. Cook the pasta according to the time on the package, or until it's ..."
            },
            {
                "title": "4 Ways to Microwave Pasta - wikiHow",
                "url": "https://www.wikihow.com/Microwave-Pasta",
                "snippet": "To microwave pasta, first, place the noodles in a large, microwave-safe bowl. If you're cooking spaghetti, break the noodles in half before putting them in. Pour in enough water to cover the noodles by 2 inches. Then, microwave the pasta for 3 minutes longer than the stove-top directions call for. Carefully remove the pasta and drain it in a ..."
            }
        ],
        "filter": "wikihow.com"
    },
    {
        "name": "do homework",
        "folderName": "do_homework",
        "url": "https://duckduckgo.com/?q=how+to+do+homework",
        "wantedNumberResults": 2500,
        "realNumberResults": 5,
        "results": [
            {
                "title": "How to Do Homework (with Pictures) - wikiHow",
                "url": "https://www.wikihow.com/Do-Homework",
                "snippet": "Create a comfortable homework spot. The best way to do homework is in a quiet space without distractions, where you'll be able to spend however much time you need to do your homework comfortably. Whether at home or elsewhere, a quiet spot is necessary for a good homework session. You might want a snack and drink just in case."
            },
            {
                "title": "3 Ways to Find Motivation to Do Homework - wikiHow",
                "url": "https://www.wikihow.com/Find-Motivation-to-Do-Homework",
                "snippet": "Before you begin doing your homework, find a spot that is quiet, well-lit, and gives you plenty of space to spread out. You'll want a place where you can sit comfortably, but don't get too comfortable. If you do homework in bed or on a cozy couch, you may be tempted to fall asleep!"
            },
            {
                "title": "3 Ways to Get Your Homework Done Fast - wikiHow",
                "url": "https://www.wikihow.com/Get-Your-Homework-Done-Fast",
                "snippet": "Doing homework can be both time-consuming and frustrating, and you probably want to do more with your free time than just homework. When you have a lot of work to do, it can be tough to work efficiently. By staying focused, organizing and planning, and motivating yourself, you can get your homework done in a timely manner and move onto more fun and exciting activities. But you should start ..."
            },
            {
                "title": "3 Ways to Get Out of Doing Homework - wikiHow",
                "url": "https://www.wikihow.com/Get-Out-of-Doing-Homework",
                "snippet": "Find out how much homework counts toward your final grade. If homework only accounts for 20% of your grade and you ace all your tests, projects, and class participation, you might be able to get by without doing homework and still get a decent grade."
            },
            {
                "title": "3 Ways to Get Boring Homework Done - wikiHow",
                "url": "https://www.wikihow.com/Get-Boring-Homework-Done",
                "snippet": "Sometimes the best way to get through boring homework is to do it with a friend. Find a classmate you can do your homework with to help keep each other motivated and on task. For extra motivation, you could start a challenge with your homework buddy. For example, you could compete to see who can get the highest grade on the next test."
            }
        ],
        "filter": "wikihow.com"
    },
    {
        "name": "fill medicine cabinet",
        "folderName": "fill_medicine_cabinet",
        "url": "https://duckduckgo.com/?q=how+to+fill+medicine+cabinet",
        "wantedNumberResults": 2500,
        "realNumberResults": 2,
        "results": [
            {
                "title": "3 Ways to Install a Medicine Cabinet - wikiHow",
                "url": "https://www.wikihow.com/Install-a-Medicine-Cabinet",
                "snippet": "How to Install a Medicine Cabinet. It takes little time and only a pencil and drill to install a surface-mounted medicine cabinet, which you simply screw onto a wall. Surface-mounting is often best if you have concrete, plaster over lath..."
            },
            {
                "title": "How to Refinish Particle Board Cabinets (with Pictures ...",
                "url": "https://www.wikihow.com/Refinish-Particle-Board-Cabinets",
                "snippet": "Prime your cabinets and wait 24-48 hours for the primer to dry. Open the windows and turn a fan on to improve the ventilation in the room while you work. Fill a paint tray halfway with an oil-based primer. Load your brush and paint the edges of your cabinets and drawers using back-and-forth strokes and painting in the direction of the wood grain."
            }
        ],
        "filter": "wikihow.com"
    },
    {
        "name": "make coffee",
        "folderName": "make_coffee",
        "url": "https://duckduckgo.com/?q=how+to+make+coffee",
        "wantedNumberResults": 2500,
        "realNumberResults": 2,
        "results": [
            {
                "title": "4 Ways to Make Instant Coffee - wikiHow",
                "url": "https://www.wikihow.com/Make-Instant-Coffee",
                "snippet": "Instant coffee is great when you need a pick-me-up but don't have a coffee maker. Unlike ground coffee, instant coffee granules are made from dehydrated brewed coffee. Although this means you can't make the actual granules at home, instant coffee is still an easy, tasty way to get your caffeine fix! It's particularly great when iced, and you ..."
            },
            {
                "title": "4 Ways to Make a Good Pot of Coffee - wikiHow",
                "url": "https://www.wikihow.com/Make-a-Good-Pot-of-Coffee",
                "snippet": "To make a good pot of coffee, start by cleaning your coffee maker to make sure old coffee residue doesn't affect the taste. Once your coffee maker is clean, measure out about 2 tablespoons of coffee grounds per cup of coffee you want to make. Put the grounds in a filter and pour fresh, cold water into the reservoir, using about 6 fluid ounces of water for each cup of coffee. Then, hit the ..."
            }
        ],
        "filter": "wikihow.com"
    },
    {
        "name": "make low carb pancakes",
        "folderName": "make_low_carb_pancakes",
        "url": "https://duckduckgo.com/?q=how+to+make+low+carb+pancakes",
        "wantedNumberResults": 2500,
        "realNumberResults": 2,
        "results": [
            {
                "title": "4 Ways to Make Low Carb Pancakes - wikiHow",
                "url": "https://www.wikihow.com/Make-Low-Carb-Pancakes",
                "snippet": "To make low-carb pancakes, start by mixing protein powder, baking powder, and salt in a large bowl. Then, make a well in the middle of the dry ingredients and add eggs, water, and cooking oil into it. Next, mix all of the ingredients together and pour some of the batter onto a heated skillet with some oil on it."
            },
            {
                "title": "Pancakes - how to articles from wikiHow",
                "url": "https://www.wikihow.com/Category:Pancakes",
                "snippet": "Learn how to make golden, fluffy pancakes in the comfort of your kitchen with wikiHow's Pancakes category. Find recipes for different flavors, from classic chocolate chip pancakes to trendy avocado pancakes! Search for recipes based on specific dietary concerns, including gluten-free pancakes and vegan pancakes, or whip up something fun, like Santa-themed pancakes!"
            }
        ],
        "filter": "wikihow.com"
    },
    {
        "name": "make mashed potato casserole",
        "folderName": "make_mashed_potato_casserole",
        "url": "https://duckduckgo.com/?q=how+to+make+mashed+potato+casserole",
        "wantedNumberResults": 2500,
        "realNumberResults": 2,
        "results": [
            {
                "title": "How to Make Simple Mashed Potatoes (with Pictures) - wikiHow",
                "url": "https://www.wikihow.com/Make-Simple-Mashed-Potatoes",
                "snippet": "Choose your potatoes. There are a few basic options when it comes to buying potatoes: baking, boiling, and all-purpose potatoes. All have different qualities when it comes to flavor and texture. Baking potatoes, such as Russets, are high in starch which creates light and fluffy mashed potatoes."
            },
            {
                "title": "How to Make a Casserole - wikiHow",
                "url": "https://www.wikihow.com/Make-a-Casserole",
                "snippet": "Potatoes. Pre-cooked potatoes can make an excellent base for breakfast or dinner casseroles, or as a topping to shepherd's pie in it's mashed form. If you want to use potato in your casserole, you can purchase frozen hash browns or parboil peeled and quartered raw potato until fork-tender. It goes especially well with beef, or other red meats ..."
            }
        ],
        "filter": "wikihow.com"
    },
    {
        "name": "make stuffed crust pizza",
        "folderName": "make_stuffed_crust_pizza",
        "url": "https://duckduckgo.com/?q=how+to+make+stuffed+crust+pizza",
        "wantedNumberResults": 2500,
        "realNumberResults": 2,
        "results": [
            {
                "title": "How to Make Stuffed‐Crust Pizza: 8 Steps (with Pictures)",
                "url": "https://www.wikihow.com/Make-Stuffed%E2%80%90Crust-Pizza",
                "snippet": "Stuffed-crust pizza is a very popular and delicious dish. The crust is stuffed with warm, melted cheese and brushed with melted butter and tasty parmesan. Stuffed-crust pizza isn't much more difficult to make than regular pizza, once you know how to do it."
            },
            {
                "title": "How to Make Stuffed French Bread Pizza: 7 Steps (with ...",
                "url": "https://www.wikihow.com/Make-Stuffed-French-Bread-Pizza",
                "snippet": "Take the french bread and depending on the desired crust: bake it. Crispy Crust - put the stuffed french bread on a cookie sheet and let it sit in the oven for a few minutes while everything warms up together."
            }
        ],
        "filter": "wikihow.com"
    },
    {
        "name": "make tea",
        "folderName": "make_tea",
        "url": "https://duckduckgo.com/?q=how+to+make+tea",
        "wantedNumberResults": 2500,
        "realNumberResults": 2,
        "results": [
            {
                "title": "How to Make Tea (with Pictures) - wikiHow",
                "url": "https://www.wikihow.com/Make-Tea",
                "snippet": "To make tea from tea leaves, start by placing the leaves in an infuser or strainer. Once filled, place the tea strainer in a mug or teapot, then pour boiling water over it. Typically, you want about one to three teaspoons of leaves for every 8 to 12 ounces of water, depending on your preference for the strength and taste of your tea. Next, allow the tea to steep -- a good rule of thumb is 2 ..."
            },
            {
                "title": "5 Ways to Make Iced Tea - wikiHow",
                "url": "https://www.wikihow.com/Make-Iced-Tea",
                "snippet": "To make iced tea, bring 2 cups (480 ml) of water to a boil, then turn off the heat. Add 3-4 bags of your favorite black tea to the hot water and let them steep for 5 minutes before discarding them. Next, transfer the tea to a large pitcher, give it 5-10 minutes to cool down, then add 2 cups (480 ml) of cold water to dilute the strong flavor. Give the tea a good stir and refrigerate it for 2-3 ..."
            }
        ],
        "filter": "wikihow.com"
    },
    {
        "name": "play video games",
        "folderName": "play_video_games",
        "url": "https://duckduckgo.com/?q=how+to+play+video+games",
        "wantedNumberResults": 2500,
        "realNumberResults": 5,
        "results": [
            {
                "title": "How to Play Video Games (with Pictures) - wikiHow",
                "url": "https://www.wikihow.com/Play-Video-Games",
                "snippet": "For the largest number of available games, get a desktop computer running the latest operating system, and install a good video card. For a cheap, easy to set up option, purchase a console. Choose a latest-generation console (PS4, Switch, or Xbox One) to play new games, or an old one (PS3, Wii, Xbox 360 or even earlier) for a large selection of ..."
            },
            {
                "title": "How to Play Video Games Successfully - wikiHow",
                "url": "https://www.wikihow.com/Play-Video-Games-Successfully",
                "snippet": "How to Play Video Games Successfully. Ever been playing a video game and suddenly a big, scary monster freaks you into pulling out the plug? Here's how to muster some courage to continue on to the next level. Calm Down. Take deep breaths..."
            },
            {
                "title": "How to Ask Your Parents if You Can Play a Game ... - wikiHow",
                "url": "https://www.wikihow.com/Ask-Your-Parents-if-You-Can-Play-a-Game",
                "snippet": "Meet their expectations. Keep your room clean. Do your homework. Finish any chores. Cover all the things your parents expect you to do beforehand. If you have a messy room and ask to play games, you will likely get a negative response. They will likely tell you to do whatever they have been bugging you to do first. Just get your duties out of ..."
            },
            {
                "title": "How to Secretly Play Video Games when You're ... - wikiHow",
                "url": "https://www.wikihow.com/Secretly-Play-Video-Games-when-You%27re-Grounded",
                "snippet": "Play video games at night when everyone's asleep if you can't during the day. If you have a portable gaming system or you like to play games on your phone, play in your bed after everyone goes to sleep. Pull the blanket up over your head so the light won't be visible under your door."
            },
            {
                "title": "Video Games - how to articles from wikiHow",
                "url": "https://www.wikihow.com/Category:Video-Games",
                "snippet": "Become a pro gamer with wikiHow's Video Games category! Get advice on gamer life, like how to find gamer friends, how to download free games, and even how to design your own video game! You can also find strategies for all your favorite games, from doing tricks on Mario Kart for Wii to throwing a curve ball in Pokémon Go, and more."
            }
        ],
        "filter": "wikihow.com"
    },
    {
        "name": "prepare birthday card",
        "folderName": "prepare_birthday_card",
        "url": "https://duckduckgo.com/?q=how+to+prepare+birthday+card",
        "wantedNumberResults": 2500,
        "realNumberResults": 2,
        "results": [
            {
                "title": "3 Ways to Make a Birthday Card - wikiHow",
                "url": "https://www.wikihow.com/Make-a-Birthday-Card",
                "snippet": "To make a birthday card, fold a piece of colorful construction paper into quarters. Next, think about the person's likes and hobbies to help you choose a design for the card's front and inside. You can draw a picture of the person you're making the card for, think of a riddle or poem, or paste pictures of the person's favorite things."
            },
            {
                "title": "3 Ways to Make Homemade Birthday Cards - wikiHow",
                "url": "https://www.wikihow.com/Make-Homemade-Birthday-Cards",
                "snippet": "On the front of the card, write a saying like \"Happy Birthday,\" then decorate it with a drawing, cut-out pictures, heart-shaped stickers, or scraps of paper cut in the shape of balloons or a hat. On the inside of the card, write a heartfelt message. To make the card even more personal, paste a meaningful photograph to the inside of the card."
            }
        ],
        "filter": "wikihow.com"
    },
    {
        "name": "prepare soup",
        "folderName": "prepare_soup",
        "url": "https://duckduckgo.com/?q=how+to+prepare+soup",
        "wantedNumberResults": 2500,
        "realNumberResults": 5,
        "results": [
            {
                "title": "How to Make Chicken Soup: 15 Steps (with Pictures) - wikiHow",
                "url": "https://www.wikihow.com/Make-Chicken-Soup",
                "snippet": "The easiest way to make hearty chicken soup is to place your cut and washed chicken breast in a pot with salt, bay leaves, and water. Let simmer for 2 ¼ hours, then add vegetables and cook for 45 more minutes. Strain the broth into a separate bowl so you can remove the chicken meat from the bone, then pour the broth, chicken, and vegetables back into the pot to serve."
            },
            {
                "title": "How to Make a Soup Without a Recipe: 12 Steps (with Pictures)",
                "url": "https://www.wikihow.com/Make-a-Soup-Without-a-Recipe",
                "snippet": "When you want to make soup, you may have things around to use, but don't know which recipe to choose, or feel like following a recipe. Maybe you just don't feel like shopping. Here is an easy answer - make a great soup without really trying or following a recipe. To make soup without a recipe, think of your soup in two basic parts. Stock, and ..."
            },
            {
                "title": "3 Ways to Make Cabbage Soup - wikiHow",
                "url": "https://www.wikihow.com/Make-Cabbage-Soup",
                "snippet": "Cook the soup for 30 minutes, or until the cabbage is tender. Taste and add more salt and pepper as desires. The soup is ready once everything is tender and the taste is to your liking. Serve the soup with a dollop of sour cream or some grated cheese. Advertisement. Method 3 of 3: Diet Cabbage Soup . 1. Sauté the vegetables. Place the olive oil in a large stockpot and heat it up over medium ..."
            },
            {
                "title": "How to Make Tomato Soup: 14 Steps (with Pictures) - wikiHow",
                "url": "https://www.wikihow.com/Make-Tomato-Soup",
                "snippet": "To make tomato soup, begin by roasting 2 pounds of peeled tomatoes, 4 cloves of garlic, 1 red pepper, and 1 onion on a baking sheet in a 350 °F oven for 30 minutes. Next, put the roasted vegetables in a stockpot along with 1 quart of chicken stock and salt and pepper. At this point, you can also add herbs and spices for more flavor. Simmer the soup for 30 minutes, then puree it in a blender ..."
            },
            {
                "title": "How to Cook Edikaikong Soup: 15 Steps - wikiHow",
                "url": "https://www.wikihow.com/Cook-Edikaikong-Soup",
                "snippet": "Toss in the periwinkle and water leaves and cook for 3 to 5 minutes. Stir 1 cup of periwinkles into the pot, then add your prepared water leaves. Allow the soup to cook for another 3 to 5 minutes. If you are on the metric system, use a 240-mL cup to measure the periwinkles out by volume rather than by weight."
            }
        ],
        "filter": "wikihow.com"
    },
    {
        "name": "vacuum",
        "folderName": "vacuum",
        "url": "https://duckduckgo.com/?q=how+to+vacuum",
        "wantedNumberResults": 2500,
        "realNumberResults": 2,
        "results": [
            {
                "title": "4 Ways to Vacuum a Rug - wikiHow",
                "url": "https://www.wikihow.com/Vacuum-a-Rug",
                "snippet": "Vacuum the topside with light suction. Unlike the underside, vacuums with beater bars are not recommended for use on the topside, as the long fibers will wrap around them and cause damage to the vacuum. Using a vacuum with high suction can also cause damage by pulling the tufts out of the carpet. Instead, use a smaller vacuum with low suction ..."
            },
            {
                "title": "How to Use a Vacuum Pump: 9 Steps (with Pictures) - wikiHow",
                "url": "https://www.wikihow.com/Use-a-Vacuum-Pump",
                "snippet": "To use a vacuum pump on an air conditioner, first, turn the pump on and open the side gauge valve, which will allow the vacuum to start pulling air out of your system. Once the valve is open, let your vacuum run at full speed for 15 to 30 minutes to pull out as much air as it can. The exact amount of time you need to let the pump run will depend on the manufacturer, so check the operational ..."
            }
        ],
        "filter": "wikihow.com"
    },
    {
        "name": "watch tv",
        "folderName": "watch_tv",
        "url": "https://duckduckgo.com/?q=how+to+watch+tv",
        "wantedNumberResults": 2500,
        "realNumberResults": 5,
        "results": [
            {
                "title": "How to Watch TV Without Cable (with Pictures) - wikiHow",
                "url": "https://www.wikihow.com/Watch-TV-Without-Cable",
                "snippet": "To watch TV without cable, choose a device replacement, such as an antenna to pick up local channels. Alternatively, if you have a good wireless network, you could purchase a Roku device or an Apple TV, which allow you to stream shows on your TV. For watching TV on your laptop, try subscribing to an online streaming service like Netflix, Hulu Plus, or Amazon Video, which charge a low monthly ..."
            },
            {
                "title": "3 Ways to Watch TV on Your Computer - wikiHow",
                "url": "https://www.wikihow.com/Watch-TV-on-Your-Computer",
                "snippet": "Watch entire seasons of TV series. Entire seasons of many television series are available from both Hulu and HBO, as well as: Netflix, which releases its original programming, like \"House of Cards\" and \"Orange is the New Black,\" by the season rather than by the episode."
            },
            {
                "title": "How to Watch YouTube on TV (with Pictures) - wikiHow",
                "url": "https://www.wikihow.com/Watch-YouTube-on-TV",
                "snippet": "This wikiHow teaches you how to watch YouTube videos on your TV screen for a more immersive experience. The simplest way to do this is to use the YouTube app on your Smart TV, streaming device, or gaming console, and then browse for videos using your regular remote. If your TV or streaming device doesn't have a YouTube app but supports casting or AirPlay, you can cast YouTube directly from ..."
            },
            {
                "title": "3 Ways to Watch TV on the Internet - wikiHow",
                "url": "https://www.wikihow.com/Watch-TV-on-the-Internet",
                "snippet": "One of the easiest ways to watch TV on the internet is by browsing TV networks on YouTube, since networks often offer free access to certain shows and movies there. If you want a better selection, sign up for an on-demand streaming service like Netflix, Hulu, or Amazon Prime. These services typically charge a low monthly fee. You can also look into cable replacement services and streaming ..."
            },
            {
                "title": "6 Simple Ways to Watch Netflix on TV - wikiHow",
                "url": "https://www.wikihow.com/Watch-Netflix-on-TV",
                "snippet": "How to Watch Netflix on TV. Netflix offers a wide range of movies, TV shows, and original content at affordable subscription prices. You can watch Netflix on nearly any internet-connected computer, smartphone, tablet, Smart TV, streaming..."
            }
        ],
        "filter": "wikihow.com"
    },
    {
        "name": "water plants",
        "folderName": "water_plants",
        "url": "https://duckduckgo.com/?q=how+to+water+plants",
        "wantedNumberResults": 2500,
        "realNumberResults": 2,
        "results": [
            {
                "title": "How to Water Indoor Plants: 13 Steps (with Pictures) - wikiHow",
                "url": "https://www.wikihow.com/Water-Indoor-Plants",
                "snippet": "Watering your indoor plants involves knowing what specific plants need, watering on their schedule, and frequently checking the soil. You can help your plants by potting them in pots that drain well and pots that are fitted to the plant's size. Healthy plants also require the right type of water and the proper amounts, but there are ways to help stabilize plants that have been overwatered, too."
            },
            {
                "title": "How to Water Plants Effectively: 12 Steps (with Pictures)",
                "url": "https://www.wikihow.com/Water-Plants-Effectively",
                "snippet": "Watering fast is like giving just 20% of water to plants rest all waste. Water slower. Doing this water will remain around roots as a result it will get more water. Watering fast may generate a great flow, causing erosion and leading to most of the water flowing away anyway."
            }
        ],
        "filter": "wikihow.com"
    }
]